"""
Создайте словарь, в котором ключами будут числа от 1 до 10, а значениями эти же числа, возведенные в куб.
"""
a = list(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)** 3
print(a)